nc: 2

scales:
  m: [0.5, 0.5, 512]

backbone:
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 2, C3k2, [96, False, 0.25]]
  - [-1, 1, Conv, [96, 3, 2]]
  - [-1, 2, C3k2, [160, False, 0.25]]
  - [-1, 1, Conv, [160, 3, 2]]
  - [-1, 2, C3k2, [160, True]]
  - [-1, 1, Conv, [320, 3, 2]]
  - [-1, 2, C3k2, [320, True]]  
  - [-1, 1, SPPF, [320, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [160, False]]

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  
  - [[-1, 4], 1, Concat, [1]]
  - [-1, 1, C3k2, [96, False]]

  - [-1, 1, Conv, [96, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]
  - [-1, 1, C3k2, [160, True]] # 18 중간 객체 검출부분은 추가 but 사용은 X

  - [-1, 1, Conv, [160, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C3k2, [320, True]] # 21 큰 객체 검출부분은 추가 but 사용은 X
 
  - [[15, 18, 21], 1, Detect, [nc]]
