nc: 2

scales:
  m: [0.5, 0.5, 512]

backbone:
  - [-1, 1, Conv, [16, 3, 2]]
  - [-1, 1, Conv, [24, 3, 2]]
  - [-1, 1, C3k2, [32, False, 0.25]] # 2
  - [-1, 1, Conv, [32, 3, 2]]
  - [-1, 1, C3k2, [48, False, 0.25]] # 4
  - [-1, 1, Conv, [48, 3, 2]]
  - [-1, 1, C3k2, [48, True]] # 6
  - [-1, 1, Conv, [96, 3, 2]] # 7
  - [-1, 1, C3k2, [96, True]] # 8
  - [-1, 1, SPPF, [96, 5]] # 9

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 10
  - [[-1, 6], 1, Concat, [1]] # 11
  - [-1, 1, C3k2, [48, False]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 13
  - [[-1, 4], 1, Concat, [1]] # 14
  - [-1, 1, C3k2, [32, False]] # 15

  - [-1, 1, Conv, [32, 3, 2]] # 16
  - [[-1, 12], 1, Concat, [1]] # 17
  - [-1, 1, C3k2, [48, True]] # 18

  - [-1, 1, Conv, [48, 3, 2]] # 19
  - [[-1, 9], 1, Concat, [1]] # 20
  - [-1, 1, C3k2, [96, True]] # 21

  - [[18], 1, Detect, [nc]] # 22
