nc: 2

scales:
  m: [0.5, 0.5, 512]

backbone:
  - [-1, 1, Conv, [8, 3, 2]]
  - [-1, 1, Conv, [16, 3, 2]]
  - [-1, 1, C3k2, [24, False, 0.25]]
  - [-1, 1, Conv, [24, 3, 2]]
  - [-1, 1, C3k2, [40, False, 0.25]]
  - [-1, 1, Conv, [40, 3, 2]]
  - [-1, 1, C3k2, [40, True]]
  - [-1, 1, Conv, [80, 3, 2]]
  - [-1, 1, C3k2, [80, True]]
  - [-1, 1, SPPF, [80, 5]]

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[10, 6], 1, Concat, [1]]
  - [-1, 1, C3k2, [40, False]]
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[13, 4], 1, Concat, [1]]
  - [-1, 1, C3k2, [24, False]]
  - [-1, 1, Conv, [24, 3, 2]]
  - [[16, 12], 1, Concat, [1]]
  - [-1, 1, C3k2, [40, True]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]
  - [-1, 1, C3k2, [64, True]]
  - [[15, 18, 21], 1, Detect, [nc]]